app/controllers/links_controller.rb

INSERT INTO "links" ("url", "keyword", "link_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["url", "www.baidu.com"], ["keyword", ""], ["link_type", 0], ["created_at", "2019-04-04 17:37:40.617450"], ["updated_at", "2019-04-04 17:37:40.617450"]]
---
  def create
    link = Link.new create_params
    link.length = params[:length]
    link.is_number = params[:is_number]

    if not link.save

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @link = Link.find_by_id(params[:id])

SELECT  "links".* FROM "links" WHERE "links"."keyword" = ? LIMIT ?  [["keyword", "links/localhost:3000/2s8xe0"], ["LIMIT", 1]]
SELECT  1 AS one FROM "links" WHERE "links"."keyword" = ? AND ("links"."id" != ?) LIMIT ?  [["keyword", "2e8vus"], ["id", 1], ["LIMIT", 1]]
UPDATE "links" SET "hits" = ?, "link_type" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["hits", 1], ["link_type", nil], ["updated_at", "2019-04-05 06:15:31.824933"], ["id", 1]]
---
  def redirect_short_url
    path = params[:path]
    link = Link.find_by_keyword(path)
    if link.present?
      link.update(hits: link.hits + 1)